<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Microsoft Office Licence Removal Tool</string>
    <key>Identifier</key>
    <string>com.github.wimm-it.download.MSOfficeLicenseRemover</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOfficeLicenseRemover</string>
        <key>DOWNLOAD_MIRROR</key>
        <string>https://go.microsoft.com/fwlink/?linkid=849815</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_MIRROR%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/semi-unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/semi-unpack/License_removal.pkg</string>
                <key>extract_root</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Scripts/postinstall</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/payload/MSOfficeLicenseRemover.sh</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                    <string>%RECIPE_CACHE_DIR%/semi-unpack</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

    </array>
</dict>
</plist>