<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the Microsoft Office Licence Removal Tool</string>
    <key>Identifier</key>
    <string>com.github.wimm-it.download.MSOfficeLicenseRemover</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MSOfficeLicenseRemover</string>
        <key>DOWNLOAD_MIRROR</key>
        <string>https://go.microsoft.com/fwlink/?linkid=849815</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_MIRROR%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string> # extract script
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string> # extract script
        </dict>
        
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

    </array>
</dict>
</plist>