<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a munki package that removes MS Office licenses.</string>
	<key>Identifier</key>
	<string>com.github.wimm-it.munki.MSOfficeLicenseRemover</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MSOfficeLicenseRemover</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/microsoft/license_remover</string>
		<key>MUNKI_CATEGORY</key>
		<string>Office</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Removes the MS Office licence.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>MSOffice License Remover</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wimm-it.download.MSOfficeLicenseRemover</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>